    [
        {
            "title": "What is Computer?",
            "subtitle": "Computer คือ อุปกรณ์อิเล็กทรอนิกส์ สำหรับคำนวณ และประมวลผลข้อมูลเพื่อประโยชน์ทางด้านธุรกิจ",
            "imageUrl": "https://cdn.pixabay.com/photo/2020/10/21/18/07/laptop-5673901_960_720.jpg",
            "details": "คอมพิวเตอร์ คือ อุปกรณ์ทางอิเล็กทรอนิกส์ (electrinic device) ที่มนุษย์ใช้เป็นเครื่องมือช่วยในการ จัดการกับข้อมูลที่อาจเป็นได้ ทั้งตัวเลข ตัวอักษร หรือสัญลักษณ์ที่ใช้แทนความหมายในสิ่งต่าง ๆ โดยคุณสมบัติที่สำคัญของคอมพิวเตอร์คือการที่สามารถกำหนดชุดคำสั่งล่วงหน้าหรือโปรแกรมได้ (programmable) นั่นคือคอมพิวเตอร์สามารถทำงานได้หลากหลายรูปแบบ ขึ้นอยู่กับชุดคำสั่งที่เลือกมาใช้งาน ทำให้สามารถนำคอมพิวเตอร์ไปประยุกต์ใช้งานได้อย่างกว้างขวาง เช่น ใช้ในการตรวจคลื่นความถี่ของหัวใจ การฝาก - ถอนเงินในธนาคาร การตรวจสอบสภาพเครื่องยนต์ เป็นต้น ข้อดีของคอมพิวเตอร์ คือ เครื่องคอมพิวเตอร์สามารถทำงานได้อย่างมีประสิทธภาพ มีความถูกต้อง และมีความรวดเร็ว"
        },
        {
            "title": "how the computer works?",
            "subtitle": "การทำงานของคอมพิวเตอร์จะเริ่มจากผู้ใช้ป้อนข้อมูลผ่านทางอุปกรณ์ของหน่วยรับเข้า  (Input  device)  เช่น  คีย์บอร์ด  เมาส์",
            "imageUrl": "https://cdn.pixabay.com/photo/2016/04/04/14/12/monitor-1307227_960_720.jpg",
            "details": "การทำงานของคอมพิวเตอร์จะเริ่มจากผู้ใช้ป้อนข้อมูลผ่านทางอุปกรณ์ของหน่วยรับเข้า  (Input  device)  เช่น  คีย์บอร์ด  เมาส์  ข้อมูลจะถูกเปลี่ยนให้เป็นสัญญาณดิจิทัล  ประกอบด้วยเลข  0  และ  1  แล้วส่งต่อไปยังหน่วยประมวลผลกลาง  เพื่อประมวลผลตามคำสั่ง  ในระหว่างการประมวลผลข้อมูลจะถูกเก็บไว้ที่  (Random  Access  Memory:  RAM)  ทำหน้าที่เก็บข้อมูลจากการประมวลผลเป็นการชั่วคราว  ขณะเดียวกัน  อาจมีคำสั่งให้นำผลลัพธ์จากการประมวลผลดังกล่าวไปแสดงผลผ่านทางอุปกรณ์ผ่านทางอุปกรณ์ของหน่วยส่งออก  เช่น จอภาพ  หรือ  เครื่องพิมพ์  นอกจากนี้เราสามารถบันทึกข้อมูลที่อยู่ในอนาคต  โดยการอ่านข้อมูลที่บันทึกในสื่อดังกล่าวผ่านทางเครื่องขับหรือไดร์ฟ  (drive)  การส่งผ่านข้อมูลไปยังหน่วยต่างๆ  ภายในระบบคอมพิวเตอร์จะผ่านทางระบบบัส  (bus)  อุปกรณ์ของหน่วยรับเข้าและส่งออก  จะเชื่อมต่อกับตัวเครื่องที่เรียกว่า ซิสเต็มยูนิต  (System  unit)  มี  เคส  (case)  เป็นโครงยืดให้อุปกรณ์ต่างๆประกอบกัน  ภายในเคสจะมีเมนบอร์ด  (Mainboard)  เป็นแผนวงจรหลัก  โดยซีพียู  หน่วยความจำ  การ์ด  รวมถึงอุปกรณ์ต่างๆ  จะถูกต่อกับเมนบอร์ดนี้ทั้งสิ้น"
        },
        {
            "title": "What is Programmer?",
            "subtitle": "Programmer คือ คนที่เขียนโปรแกรมสั่งให้คอมพิวเตอร์ทำงานตามที่ต้องการได้ และควรจะมีความชำนาญด้วย",
            "imageUrl": "https://cdn.pixabay.com/photo/2021/08/04/13/06/software-developer-6521720_960_720.jpg",
            "details": "โปรแกรมเมอร์ คือ คนที่เขียนโปรแกรมสั่งให้คอมพิวเตอร์ทำงานตามที่ต้องการได้ และควรจะมีความชำนาญด้วย ( สำหรับคนที่หัดเขียนใหม่ ๆ ไม่ควรจะใช้คำ ๆ นี้) นักเขียนโปรแกรมที่ดีนั้น จะต้องรู้วิธีแก้ปัญหา และรู้ด้วยว่า จะแก้อย่างไร รวมทั้งต้องเข้าใจหลักและกฎเกณฑ์ของภาษาต่าง ๆ ที่จะทำให้เครื่องคอมพิวเตอร์เข้าใจด้วย เพื่อจะได้ปฏิบัติตามคำสั่งได้"
        },
        {
            "title": "What is Programming?",
            "subtitle": "Programming คือ การเขียนหรือสร้างคำสั่งให้คอมพิวเตอร์ทำงานให้ได้ตามที่ต้องการ ด้วยภาษาที่คอมพิวเตอร์เข้าใจ",
            "imageUrl": "https://cdn.pixabay.com/photo/2016/11/19/14/00/code-1839406_960_720.jpg",
            "details": "โปรแกรมมิ่ง คือ การเขียนหรือสร้างคำสั่งให้คอมพิวเตอร์ทำงานให้ได้ตามที่ต้องการ ด้วยภาษาที่คอมพิวเตอร์เข้าใจ (สามารถแปลได้) ในการเขียนโปรแกรมนี้ ผู้เขียนจะต้องเข้าใจถึงขั้นตอนการแก้ปัญหา วิธีการแก้ รวมทั้ง ศัพท์และไวยากรณ์ ตลอดจนกฎเกณฑ์ของภาษาที่เลือกใช้"
        }
    ]
